# Week 8 Data Wrangling
> ## Emma Wasserman

# Package import

In [7]:
pip install pandas

Requirement already satisfied: pandas in ./.venv/lib/python3.8/site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in ./.venv/lib/python3.8/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in ./.venv/lib/python3.8/site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.1 in ./.venv/lib/python3.8/site-packages (from pandas) (2025.1)
Requirement already satisfied: numpy>=1.20.3 in ./.venv/lib/python3.8/site-packages (from pandas) (1.24.4)
Requirement already satisfied: six>=1.5 in ./.venv/lib/python3.8/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [8]:
import numpy as numpy
import pandas as pandas

# Data Wrangling Practice

In [9]:
# Create a string object assigned to the variable url
url = "https://raw.githubusercontent.com/juanklopper/TutorialData/main/PUBH1142Chap0801.csv"

In [10]:
# Import the data from the URL as a pandas Dataframe assign it to the variable df
# object assignd to the variable df
df = pandas.read_csv(url)

In [13]:
df.head()

,Name,DOB,Age,Vocation,Smoke,HR,sBP,CholesterolBefore,TAG,Survey,CholesterolAfter,Delta,Group
0,Dylan Patton,1981-10-07,43,Energy manager,0,47,145,1.2,1.2,1,0.7,0.5,Active
1,Sandra Howard,1993-01-27,53,Tax adviser,0,51,115,1.2,0.6,3,1.0,0.2,Active
2,Samantha Williams,1973-12-21,33,IT consultant,0,54,120,2.0,1.3,3,1.7,0.3,Active
3,Ashley Hensley,1981-12-01,43,"Nurse, children's",0,54,103,2.1,1.6,4,2.1,0.0,Active
4,Robert Wilson,1964-06-23,46,Clinical embryologist,0,61,138,2.8,2.1,5,2.8,0.0,Active

In [11]:
# show the "age" column
df['Age']

0      43
1      53
2      33
3      43
4      46
       ..
195    66
196    54
197    61
198    65
199    66
Name: Age, Length: 200, dtype: int64

In [12]:
df.iloc[0]

Name                   Dylan Patton
DOB                      1981-10-07
Age                              43
Vocation             Energy manager
Smoke                             0
HR                               47
sBP                             145
CholesterolBefore               1.2
TAG                             1.2
Survey                            1
CholesterolAfter                0.7
Delta                           0.5
Group                        Active
Name: 0, dtype: object

In [13]:
df.iloc[0:5]

,Name,DOB,Age,Vocation,Smoke,HR,sBP,CholesterolBefore,TAG,Survey,CholesterolAfter,Delta,Group
0,Dylan Patton,1981-10-07,43,Energy manager,0,47,145,1.2,1.2,1,0.7,0.5,Active
1,Sandra Howard,1993-01-27,53,Tax adviser,0,51,115,1.2,0.6,3,1.0,0.2,Active
2,Samantha Williams,1973-12-21,33,IT consultant,0,54,120,2.0,1.3,3,1.7,0.3,Active
3,Ashley Hensley,1981-12-01,43,"Nurse, children's",0,54,103,2.1,1.6,4,2.1,0.0,Active
4,Robert Wilson,1964-06-23,46,Clinical embryologist,0,61,138,2.8,2.1,5,2.8,0.0,Active

In [14]:
df.iloc[0:5, 0:5]

                Name         DOB  Age               Vocation  Smoke
0       Dylan Patton  1981-10-07   43         Energy manager      0
1      Sandra Howard  1993-01-27   53            Tax adviser      0
2  Samantha Williams  1973-12-21   33          IT consultant      0
3     Ashley Hensley  1981-12-01   43      Nurse, children's      0
4      Robert Wilson  1964-06-23   46  Clinical embryologist      0

In [15]:
df.loc[0:5,['Name', 'Age']]

                Name  Age
0       Dylan Patton   43
1      Sandra Howard   53
2  Samantha Williams   33
3     Ashley Hensley   43
4      Robert Wilson   46
5        Leslie Diaz   48

In [16]:
age=df['Age']

In [17]:
type(age)

pandas.core.series.Series

In [18]:
age=df.Age.to_numpy()

In [19]:
age

array([43, 53, 33, 43, 46, 48, 54, 58, 44, 31, 45, 35, 49, 56, 57, 38, 35,
       50, 45, 49, 63, 45, 51, 43, 31, 58, 40, 47, 45, 41, 47, 38, 54, 30,
       46, 64, 41, 40, 45, 65, 74, 55, 58, 53, 68, 54, 72, 32, 38, 59, 53,
       69, 42, 67, 38, 51, 37, 36, 34, 38, 31, 48, 49, 62, 39, 74, 41, 42,
       60, 67, 42, 74, 52, 37, 61, 54, 72, 36, 49, 47, 49, 49, 69, 43, 38,
       60, 45, 71, 65, 73, 60, 70, 45, 49, 65, 53, 30, 58, 50, 69, 72, 61,
       33, 30, 44, 71, 49, 75, 43, 35, 55, 38, 36, 46, 60, 40, 57, 69, 56,
       66, 60, 42, 49, 68, 32, 31, 56, 35, 63, 54, 68, 72, 40, 41, 66, 73,
       36, 54, 57, 74, 48, 72, 54, 71, 42, 54, 66, 58, 60, 63, 44, 55, 73,
       55, 40, 43, 71, 54, 61, 55, 67, 55, 68, 71, 54, 42, 53, 69, 57, 45,
       62, 33, 74, 74, 64, 43, 35, 57, 64, 55, 74, 50, 40, 62, 65, 63, 68,
       45, 41, 54, 62, 65, 72, 61, 70, 66, 54, 61, 65, 66])

In [20]:
age.mean()

53.07

In [21]:
df.columns

Index(['Name', 'DOB', 'Age', 'Vocation', 'Smoke', 'HR', 'sBP',
       'CholesterolBefore', 'TAG', 'Survey', 'CholesterolAfter', 'Delta',
       'Group'],
      dtype='object')

In [22]:
vocations=df['Vocation']

In [23]:
# Tell me the unique elements in "vocations"
vocations.unique()

array(['Energy manager', 'Tax adviser', 'IT consultant',
       "Nurse, children's", 'Clinical embryologist',
       "Politician's assistant", 'Police officer',
       'Scientific laboratory technician', 'Lexicographer',
       'Charity fundraiser', 'Chief Marketing Officer', 'Hydrologist',
       'Advertising account planner', 'Web designer', 'Lobbyist',
       'Photographer', 'Chartered loss adjuster',
       'Community education officer', 'Occupational hygienist',
       'Conservation officer, nature', 'Chemist, analytical',
       'Immunologist', 'Exhibition designer', 'Special effects artist',
       'Broadcast presenter', 'Psychologist, occupational', 'Midwife',
       'Meteorologist', 'Sports therapist', 'Therapist, horticultural',
       'Mining engineer', 'Estate agent', 'Waste management officer',
       'Tourist information centre manager', 'Lecturer, higher education',
       'Research scientist (physical sciences)', 'Technical brewer',
       'Minerals surveyor', 'Commercial/residential surveyor',
       'Lecturer, further education', 'Programmer, systems',
       'Insurance claims handler', 'Media planner',
       'Magazine features editor', 'Research scientist (medical)',
       'Arts administrator', 'Museum/gallery exhibitions officer',
       'Scientist, research (physical sciences)', 'Journalist, magazine',
       'Professor Emeritus', 'Buyer, industrial', 'Journalist, newspaper',
       'Ergonomist', 'Estate manager/land agent',
       'Logistics and distribution manager', 'Scientist, audiological',
       'Counselling psychologist', 'Pharmacist, community',
       'Aeronautical engineer', 'Advertising copywriter',
       'Landscape architect', 'Psychologist, sport and exercise',
       'Surveyor, hydrographic', 'Secretary, company',
       'Financial controller', 'Teacher, secondary school', 'Cabin crew',
       'Cartographer', 'Passenger transport manager', 'Graphic designer',
       'Brewing technologist', 'Industrial buyer', 'Designer, textile',
       'Nature conservation officer', 'Set designer',
       'Information officer', 'Product designer', 'Contractor',
       'Nurse, learning disability', 'Insurance broker',
       'Hydrographic surveyor', 'Corporate investment banker',
       'Bookseller', 'Lawyer', 'Surveyor, mining', 'Engineer, mining',
       'Dealer', 'Psychotherapist, child', 'Computer games developer',
       'Paramedic', 'Clinical biochemist', 'Forensic psychologist',
       'Communications engineer', 'Herpetologist',
       'Engineer, manufacturing', 'Agricultural consultant',
       'Engineer, energy', 'Community pharmacist', 'Music tutor',
       'Trading standards officer', 'Statistician',
       'Manufacturing systems engineer', 'Call centre manager',
       'Control and instrumentation engineer',
       'Medical sales representative', 'Trade union research officer',
       'Trade mark attorney', 'Publishing copy', 'Mental health nurse',
       'Maintenance engineer', 'Translator', 'Volunteer coordinator',
       'Secretary/administrator', 'Museum/gallery conservator',
       'Biomedical scientist', 'Medical illustrator',
       'Geophysicist/field seismologist', 'Corporate treasurer',
       'Fish farm manager', 'Dancer', 'Heritage manager',
       'Legal executive', 'Energy engineer', 'Musician',
       'Careers information officer', 'Careers adviser', 'Oncologist',
       'Video editor', 'Engineering geologist',
       'Surveyor, building control', 'Cytogeneticist',
       'Accommodation manager', 'Public house manager',
       'Production manager', 'Bonds trader', 'Electrical engineer',
       'Media buyer', 'English as a foreign language teacher',
       'Horticultural consultant', 'Accountant, chartered certified',
       'Archivist', 'Development worker, international aid',
       'Animal technologist', 'Engineer, civil (contracting)',
       'Newspaper journalist', 'Engineer, electronics',
       'Administrator, sports', 'Journalist, broadcasting',
       'Radiation protection practitioner', 'Private music teacher',
       'Adult guidance worker', 'Scientist, marine', 'Furniture designer',
       'Operational investment banker', 'Therapeutic radiographer',
       'Building control surveyor', 'Occupational therapist',
       'Personnel officer', 'Fashion designer',
       'Surveyor, planning and development',
       'Engineer, control and instrumentation', 'Solicitor, Scotland',
       'Dramatherapist', 'Advertising account executive',
       'Sport and exercise psychologist',
       'Senior tax professional/tax inspector',
       'Psychologist, educational', 'Designer, television/film set',
       'Geneticist, molecular', 'Sales professional, IT',
       'Chartered certified accountant', 'Theme park manager'],
      dtype=object)

In [24]:
# Extract the first five rows for the Name and Age colunms using the loc method
df.loc[:4, ['Name', 'Age']] # Note the difference in row index compared to the iloc method

                Name  Age
0       Dylan Patton   43
1      Sandra Howard   53
2  Samantha Williams   33
3     Ashley Hensley   43
4      Robert Wilson   46

In [27]:
# Extract the value in row 2, column 1 using the iat method
df.iat[1, 0]

'Sandra Howard'

### Overview of Data Wrangling: Pandas Index Selection Methods

#### `.loc` - Label-based Indexing
* Uses labels/index to select data
* Syntax is inclusive of last element
* Good for selecting columns by name

In [ ]:
# Example of .loc
# Select rows with index labels 1 through 3 and columns 'name' and 'age'
df.loc[1:3, ['name', 'age']]

# Select all rows where age > 30
df.loc[df['age'] > 30]



#### `.iloc` - Integer-based Indexing
* Uses integer position to select data
* Zero-based numbering
* Exclusive of last element

In [ ]:
# Example of .iloc
# Select first 3 rows and first 2 columns
df.iloc[0:3, 0:2]

# Select specific rows by position
df.iloc[[0, 2, 4]]



#### `.iat` - Fast Integer-based Access
* For single value selection
* Fastest method for scalar lookup
* Uses integer indices only

In [ ]:
# Example of .iat
# Select value at first row, second column
df.iat[0, 1]

# Compare performance
%timeit df.iat[0, 1]      # Fastest
%timeit df.iloc[0, 1]     # Slower
%timeit df.loc[0, 'col']  # Slowest



### Key Differences
* `.loc`: Label-based, inclusive range
* `.iloc`: Integer-based, exclusive range
* `.iat`: Single value access, fastest performance

### Best Practices
* Use `.loc` when working with labeled data
* Use `.iloc` when working with positional data
* Use `.iat` for single value lookups in performance-critical code

# Quiz Questions

#### Q: How do you import the pandas library in Python?

In [ ]:
import pandas as pd



#### Q: How do you read a CSV file named data.csv into a pandas DataFrame?

In [ ]:
df = pd.read_csv('data.csv')



#### Q: How do you display the first 5 rows of a DataFrame named df?

In [ ]:
df.head()



#### Q: How do you find the number of rows and columns in a DataFrame df?

In [ ]:
df.shape



#### Q: How do you print the names of all the columns in a DataFrame df?

In [ ]:
df.columns



#### Q: How do you get the summary information of the DataFrame df?

In [ ]:
df.info()



#### Q: How do you select rows where column A is greater than 5?

In [ ]:
df[df['A'] > 5]



#### Q: How do you select the columns A and B from the DataFrame df?

In [ ]:
df[['A', 'B']]



#### Q: How do you rename the column A to Alpha in DataFrame df?

In [ ]:
df = df.rename(columns={'A': 'Alpha'})



#### Q: How do you replace all occurrences of 999 with nan?

In [ ]:
import numpy as np
df = df.replace(999, np.nan)



#### Q: How do you drop rows with missing values?

In [ ]:
df = df.dropna()



#### Q: How do you fill missing values with 0?

In [ ]:
df = df.fillna(0)



#### Q: How do you calculate the mean of column A?

In [ ]:
df['A'].mean()



#### Q: How do you create a new column C as sum of A and B?

In [ ]:
df['C'] = df['A'] + df['B']



#### Q: How do you save DataFrame df to output.csv?

In [ ]:
df.to_csv('output.csv', index=False)